{
  "staged_at": "2026-02-09T05:38:18Z",
  "staged_by": "ingest-pipeline",
  "source_id": "aws-database-blog",
  "source_url": "https://aws.amazon.com/blogs/database/amazon-dynamodb-global-tables-now-support-replication-across-aws-accounts/",
  "dedup_score": 0.26,
  "closest_existing": "Inactive DynamoDB Table",
  "recommendation": {
    "id": "21e8990b-f442-4975-8927-70399f242f0f",
    "service_name": "dynamodb",
    "scenario": "DynamoDB tables with critical data lack cross-account global table replication for disaster recovery isolation",
    "alert_criteria": "DynamoDB tables classified as critical or high-availability are not configured with multi-account global tables replication. Single-account tables lack the account-level isolation needed to protect against account-level incidents, misconfigurations, or security compromises.",
    "recommendation_action": "Evaluate critical DynamoDB tables for multi-account global table configuration using the new cross-account replication feature. Create replica tables in separate AWS accounts and regions to provide account-level isolation for disaster recovery. Monitor replication latency using the ReplicationLatency CloudWatch metric. Implement resource-based policies to control which accounts can join the replication group.",
    "risk_detail": "reliability, security",
    "build_priority": 2,
    "action_value": 2,
    "effort_level": 2,
    "risk_value": 2,
    "recommendation_description_detailed": "DynamoDB global tables support multi-Region replication for high availability, but same-account replicas are still vulnerable to account-level incidents such as credential compromise, SCPs that restrict operations, or accidental account suspension. The new multi-account global tables feature enables replication across separate AWS accounts, providing additional isolation layers that limit the blast radius of misconfigurations, security incidents, or account-level issues. This is particularly important for organizations that operate with strict disaster recovery requirements or need compliance with data isolation mandates. Multi-account replicas also enable proper cost attribution across business units and alignment with organizational account structures. Each replica must reside in a separate account and Region, and the feature uses resource-based policies for cross-account authorization.",
    "category": "database",
    "references": [
      "https://aws.amazon.com/blogs/database/amazon-dynamodb-global-tables-now-support-replication-across-aws-accounts/"
    ],
    "metadata": {
      "created_at": "2026-02-09T05:38:18Z",
      "updated_at": "2026-02-09T05:38:18Z",
      "contributors": [
        "ingest-pipeline"
      ],
      "source": "AWS Database Blog"
    },
    "tags": [
      "dynamodb",
      "global-tables",
      "disaster-recovery",
      "multi-account",
      "replication",
      "high-availability"
    ]
  }
}
