{
  "staged_at": "2026-02-09T05:38:18Z",
  "staged_by": "ingest-pipeline",
  "source_id": "aws-database-blog",
  "source_url": "https://aws.amazon.com/blogs/database/managing-ip-address-exhaustion-for-amazon-rds-proxy/",
  "dedup_score": 0.317,
  "closest_existing": "Unassociated Elastic IP Addresses",
  "recommendation": {
    "id": "4dd1933d-e014-4a2f-b044-497c050c5983",
    "service_name": "rds",
    "scenario": "RDS Proxy subnets have insufficient available IP addresses causing connection failures and blocking security patches",
    "alert_criteria": "Amazon RDS event ID RDS-EVENT-0243 is generated indicating insufficient available IP addresses in subnets configured for RDS Proxy. Available IP addresses in RDS Proxy subnets fall below the minimum reservation threshold for the database instance class size.",
    "recommendation_action": "Monitor RDS Proxy subnet IP utilization using CloudWatch and RDS events. When IP address exhaustion is detected, expand VPC CIDR ranges, create new subnets with adequate address space, and migrate the RDS Proxy to the new subnet configuration using a parallel deployment approach. For long-term resolution, consider migrating to IPv6 if workloads support it. Plan subnet sizing based on the IP reservation requirements documented for each RDS instance class.",
    "risk_detail": "security, reliability, performance",
    "build_priority": 1,
    "action_value": 2,
    "effort_level": 2,
    "risk_value": 2,
    "recommendation_description_detailed": "Amazon RDS Proxy dynamically adjusts its capacity based on database instance size, number of registered instances, and scaling operations. When subnets lack sufficient available IP addresses, RDS Proxy performance degrades through increased query latency and connection failures. More critically, IP address exhaustion prevents the Amazon RDS team from applying essential OS security patches to Proxy servers, exposing infrastructure to security vulnerabilities. It also blocks new feature availability for the proxy. Organizations should proactively monitor subnet IP utilization and plan capacity based on the minimum IP reservation requirements documented for each database instance class. The RDS-EVENT-0243 event provides an early warning signal before critical impact occurs.",
    "category": "database",
    "references": [
      "https://aws.amazon.com/blogs/database/managing-ip-address-exhaustion-for-amazon-rds-proxy/"
    ],
    "metadata": {
      "created_at": "2026-02-09T05:38:18Z",
      "updated_at": "2026-02-09T05:38:18Z",
      "contributors": [
        "ingest-pipeline"
      ],
      "source": "AWS Database Blog"
    },
    "tags": [
      "rds",
      "rds-proxy",
      "networking",
      "ip-exhaustion",
      "vpc",
      "subnet-planning",
      "capacity"
    ]
  }
}
