{
  "staged_at": "2026-02-09T05:38:18Z",
  "staged_by": "ingest-pipeline",
  "source_id": "aws-database-blog",
  "source_url": "https://aws.amazon.com/blogs/database/control-database-name-visibility-in-amazon-rds-for-sql-server-instances/",
  "dedup_score": 0.218,
  "closest_existing": "customer needs a database but is not sure which one to select or what to configure",
  "recommendation": {
    "id": "5c3d02fe-0ca2-45fe-be46-ef6ac1c678be",
    "service_name": "rds",
    "scenario": "RDS for SQL Server multi-tenant instances expose all database names to authenticated users by default",
    "alert_criteria": "RDS for SQL Server instances hosting multiple tenant databases have not used the rds_manage_view_db_permission stored procedure to restrict database name visibility per login. All authenticated users can view all database names in the instance.",
    "recommendation_action": "Use the Amazon RDS for SQL Server custom stored procedure msdb.dbo.rds_manage_view_db_permission to deny database visibility for tenant-specific logins. Apply this procedure to each tenant login so they can only see their own database names while maintaining full access to their authorized databases. Validate the configuration by confirming restricted visibility and document the process for new tenant onboarding.",
    "risk_detail": "security",
    "build_priority": 2,
    "action_value": 2,
    "effort_level": 1,
    "risk_value": 2,
    "recommendation_description_detailed": "By default, SQL Server's PUBLIC role allows all authenticated users to view every database name on the instance. In multi-tenant environments where database names may contain or reveal tenant identifiers, this default behavior creates an information disclosure risk. Tenants can discover the existence of other tenants, potentially revealing business relationships, customer names, or organizational structure. For ISVs and SaaS providers hosting multiple customer databases on shared RDS for SQL Server instances, this is a significant concern that can violate data isolation requirements and tenant confidentiality expectations. The RDS-specific stored procedure rds_manage_view_db_permission provides per-login control over database visibility without requiring server-level permission changes that are not available in the managed RDS environment.",
    "category": "database",
    "references": [
      "https://aws.amazon.com/blogs/database/control-database-name-visibility-in-amazon-rds-for-sql-server-instances/"
    ],
    "metadata": {
      "created_at": "2026-02-09T05:38:18Z",
      "updated_at": "2026-02-09T05:38:18Z",
      "contributors": [
        "ingest-pipeline"
      ],
      "source": "AWS Database Blog"
    },
    "tags": [
      "rds",
      "sql-server",
      "multi-tenant",
      "information-disclosure",
      "tenant-isolation",
      "saas"
    ]
  }
}
